# _*_ coding:utf-8 _*_
# @Time :2020/6/7 12:36
# @Author :yanxia

import re
#
# line = '''
# 回复：【项目上线】互动-互动后台-v2.36.0-修复极速版话题、圈子、关注等问题
# 回复：【项目上线】产品库v4.93.8_产品库修复PC车型询价跳转404
# 回复：【项目上线】产品库v4.93.7_产品库询价弹窗增加埋点统计
# 回复：【项目上线】产品库v4.93.6_产品库优化询价弹窗提交按钮默认状态
# 回复：【项目上线】产品库v4.93.5_产品库优化询价弹窗提交按钮默认状态
# 回复：【项目上线】产品库-v4.93.4-修复文章图片、询价文案错误
# 回复：【项目上线】产品库v4.92.2-产品库视频、文章、论坛样式改版  &&  暂无报价文案修改
# 回复：【项目上线】产品库-产品库-v4.52.0-产品库综述页视频文章样式改版
# 回复：【项目上线】产品库-产品库-v4.92.2-产品库暂无报价文案修改
# 回复：【项目上线】产品库v4.92.2_产品库视频、文章、论坛样式改版  &&  暂无报价文案修改
# 回复：【项目上线】 商业配合-专题v1.0.0-柳汽乘龙百万运营官专题前台修改
# 回复：【项目上线】公共服务-评论系统v2.0.3修复线上埋点推送问题
# 回复：【项目上线】互动-互动平台-v2.39.0-首页&社区关注列表推荐关注中存在重复数据
# 回复：【项目上线】IT系统-ERP系统-v1.6.0
# '''
def ww():
    c="【项目上线】产品库v4.92.2_产品库视频、文章、论坛样式改版  &&  暂无报价文案修改"
    a="产品库"
    b="商业配合"
    l="null"
    k="null"
    lo="null"
    j=""
    w=[]
    if a in c:
        q=w.append(a)


    elif b in c:
        w.append(b)
    else:
        w.append(l)

    e="互动平台"
    if e in c:
        w.append(e)
    else:
        w.append(k)

    v=re.findall(r'\d+\.(?:\d+\.)*\d+',c)
    h=''.join(v)
    print(h)
    if h in c:
        w.append(h)
    else:
        w.append(lo)
    return w
def nn(w):
    s=','.join(w)
    print(s)

print(ww())
z=nn(ww())



#
# elif ""
# pattern = r'v\d+\.(?:\d+\.)*\d+'
# m = re.findall(pattern, line)
# result = ''.join(m)
# print(result,type(result))

